Repository: damasceno-dev/myRecipeBook-Backend
Catalog: MyRecipeBook.Exception/ResourceErrorMessages.*.resx
Languages: pt_br

# NAME_NOT_EMPTY
source: Name can not be empty
pt_br: O nome não pode ser vazio

# EMAIL_NOT_EMPTY
source: Email can not be empty
pt_br: O e-mail não pode ser vazio

# EMAIL_INVALID
source: This is not a valid e-mail
pt_br: E-mail inválido

# PASSWORD_LENGTH
source: Invalid password length
pt_br: Senha muito curta

source: Unknown error
pt_br: Erro desconhecido

# EMAIL_ALREADY_EXISTS
source: This email is already registered
pt_br: Esse e-mail já está registrado

# EMAIL_NOT_ACTIVE
source: This e-mail is not active
pt_br: Esse e-mail está inativo

# EMAIL_NOT_REGISTERED
source: This e-mail is not registered
pt_br: Esse e-mail não está cadastrado

# PASSWORD_WRONG
source: Wrong password
pt_br: Senha incorreta

source: Token empty
pt_br: Token vazio

source: Token expired
pt_br: Token expirado

source: Token with no permission
pt_br: Token sem permissão

# PASSWORD_EMPTY
source: Empty password
pt_br: Senha vazia

# RECIPE_TITLE_EMPTY
source: Recipe title cannot be empty
pt_br: O título da receita não pode ser vazio

# RECIPE_DIFFICULTY_NOT_IN_ENUM
source: Recipe difficulty must be one of the defined values
pt_br: A dificuldade da receita deve estar entre os valores definidos

# RECIPE_COOKING_TIME_NOT_IN_ENUM
source: Recipe cooking time must be one of the defined values
pt_br: O tempo de preparo da receita deve estar entre os valores definidos

# RECIPE_INGREDIENT_NOT_EMPTY
source: Each ingredient must not be empty
pt_br: Cada ingrediente não pode ser vazio

# RECIPE_INSTRUCTION_STEP_GREATER_THAN_0
source: Instruction step must be greater than 0
pt_br: O passo da instrução deve ser maior que 0

# RECIPE_INSTRUCTION_TEXT_NOT_EMPTY
source: Instruction text must not be empty
pt_br: O texto da instrução não pode ser vazio

# RECIPE_INSTRUCTION_TEXT_LESS_THAN_2000
source: Instruction text must be less than 2000 characters
pt_br: O texto da instrução deve ter menos de 2000 caracteres

# RECIPE_INSTRUCTION_DUPLICATE_STEP_INSTRUCTION
source: Each instruction step must be unique
pt_br: Cada passo da instrução deve ser único

# RECIPE_DISH_TYPE_NOT_IN_ENUM
source: Dish type must be one of the defined values
pt_br: O tipo de prato deve estar entre os valores definidos

# RECIPE_AT_LEAST_ONE_INGREDIENT
source: Recipe ingredients must not be empty
pt_br: A lista de ingredientes não pode ser vazia

source: Recipe not found
pt_br: Receita não encontrada

# RECIPE_NUMBER_GREATER_THAN_0
source: Number of recipes must be greater than zero
pt_br: Número de receitas deve ser maior que zero

# RECIPE_INGREDIENT_INVALID_SEPARATORS
source: Ingredients must only contain words separated by spaces. Invalid separators like `-`, `/`, or `_` are not allowed
pt_br: Ingredientes devem conter palavras separadas apenas por espaços. Separadores como `-`, `/`, ou `_` não são permitidos

# RECIPE_INGREDIENT_INVALID_START_CHARACTER
source: Ingredients must start with a valid number, fraction, or word
pt_br: Ingredientes devem começar com número, fração, ou palavra

# RECIPE_INGREDIENT_MAXIMUM_WORD_COUNT
source: Maximum word count exceeded
pt_br: Máximo de palavras excedido

# RECIPE_INGREDIENT_INVALID_CHARACTER
source: Ingredients must only contain letters, numbers, and spaces. Special characters are not allowed, except in fractions like `3/4`
pt_br: Ingredientes devem conter apenas letras, números e espaços. Caracteres especiais não são permitidos, exceto frações como `3/4`

# RECIPE_INGREDIENT_UNEXPECTED_ERROR
source: Unexpected error during ingredient validation
pt_br: Erro inesperado na validação do ingrediente

# RECIPE_INGREDIENT_LIST_MAXIMUM_COUNT
source: Maximum number of ingredients exceeded
pt_br: Número máximo de ingredientes excedido

# IMAGE_INVALID_TYPE
source: Only types .jpg and .png are accepted as images
pt_br: Apenas os tipos .jpg e .png são aceitos como imagem
